? 			->user exec commands
Router>enable 		->om van user exe mode naar priv. mode te gaan
router#

Router#configure terminal		->om naar de confic mode te gaan
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#

Router(config)#interface gigabitEthernet 0/0 	-> een netwerk interface een ipadress geven en aanschakelen
Router(config-if)#ip address 192.168.1.1 255.255.255.0
Router(config-if)#no shutdown

Router(config-if)#exit 			-> om een niveau lager te gaan
Router(config)#

Router(config)#line vty 0 1		-> telnet aanzetten met wachtwoord vty 0 1 zorgt voor 2 gelijke connecties 0 5 zou dan voor 6 
Router(config-line)#password PXL	   connecties zorgen
Router(config-line)#login

Router(config)#line console 0		-> ww op de console rooter zetten
Router(config-line)#password PXL
Router(config-line)#login

Router(config)#enable secret PXL	-> ww geencrypteerd zetten op de priv mode


Switch(config)#interface vlan1		-> de management zetten op de priv mode
Switch(config-if)#ip address 192.168.1.254 255.255.255.0
Switch(config-if)#no shutdown 

Switch(config)#ip default-gateway 192.168.1.1 		-> default gateway toewijzen aan een switch
Switch(config)#

Switch(config)#hostname B148			-> verander de promt
B148(config)#

Router#copy run start			-> kopieerd running conf naar starter conf

Router#(config)#service password-encryption		-> versleutelt elk ww in de conf

Router#show run 			-> toont de running conf

Router#show startup-config		-> toont de startup conf

Router0(config) ip domain-name demo.local  -> zet de domain naam als demo.local

Router0(config)#line vty 0 4        ->telnet aanzetten zonder ww met 5 gelijke connecties
Router0(config-line)#login local
Router0(config-line)#transport input ssh        -> ssh als protocol instellen

Router0(config)#username student password pxl       -> instellen van een username en een password 

Router0(config)#username student secret pxl         -> instellen van een username met een secret password

Router0(config)#crypto key generate rsa             -> instellen van een 1024 bit encryptie nog integen is 1024 aantal bits 
The name for the keys will be: Router0.demo.local
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 1024
% Generating 1024 bit RSA keys, keys will be non-exportable...[OK]

SwitchLeft#show mac address-table       -> mac address table laten zien

SwitchLeft#clear mac address-table      -> mac address table leegmaken

RouterISP(config)#interface gigabitEthernet 0/0/0     -> instellen van det ipv6 address
RouterISP(config-if)#ipv6 address 2001:db8:1:1::1/64

RouterISP(config-if)#ipv6 address fe80::1:1 link-local  -> instellen van de ipv6 link local

SwitchB(config)#banner motd "HerhalingsOefening"    -> aanmaken van een banner

ipconfig /all   -> om het mac adressen te vinden via de command promp van de PC
Physical Address (MAC): 0000.0000.00A2    -> de 0000.0000.00a2 is het mac address

SwitchA#show interfaces vlan 1      -> zoeken van het mac address van een switch
  Hardware is CPU Interface, address is 0003.e449.810c (bia 0003.e449.810c)   -> 0003.e449.810c is het mac address

Router#show interfaces  -> gaat de mac adressen pet G poort van de router tonen
 GigabitEthernet0/0 is up, line protocol is up (connected)
  Hardware is CN Gigabit Ethernet, address is 0000.0000.aaaa -> 0000.0000.aaaa is het mac adress voor poort G0/0


